In [1]:
import pandas as pd
import numpy as np

dlc = {"이름":['김수안','김수정','박동윤','강이안','강지안'],
      "나이":[19,23,22,19,16],
      "성별":['여','여','남','여','남'],
      "평점":[4.35,4.23,4.45,4.37,4.25]}

In [2]:
data = pd.DataFrame(dlc)

In [3]:
data

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [4]:
data['연락처'] = [None,None,None,None,None]

In [5]:
data

    이름  나이 성별    평점   연락처
0  김수안  19  여  4.35  None
1  김수정  23  여  4.23  None
2  박동윤  22  남  4.45  None
3  강이안  19  여  4.37  None
4  강지안  16  남  4.25  None

In [6]:
data.any(axis = 0)

이름      True
나이      True
성별      True
평점      True
연락처    False
dtype: bool

In [7]:
pd.DataFrame({'a':[False,False,False]}).any()

a    False
dtype: bool

In [8]:
pd.DataFrame({'a':[False,False,True]}).any()

a    True
dtype: bool

In [9]:
pd.DataFrame({'a':[0, 0, 0]}).any()

a    False
dtype: bool

In [10]:
a = pd.DataFrame({'a':[0, 0, 0]})

In [11]:
a.any()

a    False
dtype: bool

In [12]:
data.isna()

      이름     나이     성별     평점   연락처
0  False  False  False  False  True
1  False  False  False  False  True
2  False  False  False  False  True
3  False  False  False  False  True
4  False  False  False  False  True

In [13]:
data.isna().any(axis = 0)  #전체 우리 데이터의 변수 중에서 전부 None 구성 되어있는 변수는 무엇일까

이름     False
나이     False
성별     False
평점     False
연락처     True
dtype: bool

In [14]:
data.any(axis = 0)

이름      True
나이      True
성별      True
평점      True
연락처    False
dtype: bool

In [15]:
data.isna().sum()

이름     0
나이     0
성별     0
평점     0
연락처    5
dtype: int64

In [16]:
data.sum(axis = 0)

이름     김수안김수정박동윤강이안강지안
나이                  99
성별               여여남여남
평점               21.65
연락처                  0
dtype: object

In [17]:
data.isna().sum(axis = 0)    # 나머지는 다 None이므로 0으로 출력

이름     0
나이     0
성별     0
평점     0
연락처    5
dtype: int64

In [18]:
data.isna().sum(axis = 1)

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [19]:
data

    이름  나이 성별    평점   연락처
0  김수안  19  여  4.35  None
1  김수정  23  여  4.23  None
2  박동윤  22  남  4.45  None
3  강이안  19  여  4.37  None
4  강지안  16  남  4.25  None

In [20]:
data.dropna(axis = 0, how = 'any')  # na값이 있는 무언가를 제거함. axis는 어느 관점에서 제거할 것인가. how는 어떠한 방식으로 제거할 것인가

Empty DataFrame
Columns: [이름, 나이, 성별, 평점, 연락처]
Index: []

In [21]:
#모두 제거해서 열의 정보만 출력됨. 나머지는 모두 제거됨

In [22]:
data.dropna(axis = 1, how = 'any')   # 연락처 제거

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [23]:
data.dropna(axis = 1, how = 'all')  # 특정 열이 None이면 모두 제거

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [24]:
data.loc['f'] = ['박성호', 20, '남', 4.5, '010-xxxx-xxxx']

In [25]:
data   # f줄이 추가됨

    이름  나이 성별    평점            연락처
0  김수안  19  여  4.35           None
1  김수정  23  여  4.23           None
2  박동윤  22  남  4.45           None
3  강이안  19  여  4.37           None
4  강지안  16  남  4.25           None
f  박성호  20  남  4.50  010-xxxx-xxxx

In [26]:
data.dropna(axis = 1, how = 'any') #적어도 한개의 None있으므로 제거됨

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25
f  박성호  20  남  4.50

In [27]:
data.dropna(axis = 1, how = 'all')  # 모든 연락처가 None이 아니므로 제거되지 않음

    이름  나이 성별    평점            연락처
0  김수안  19  여  4.35           None
1  김수정  23  여  4.23           None
2  박동윤  22  남  4.45           None
3  강이안  19  여  4.37           None
4  강지안  16  남  4.25           None
f  박성호  20  남  4.50  010-xxxx-xxxx

In [28]:
data.loc['g'] = None

/var/folders/3d/kn7vpxbj1kq30df_5r2lj8q00000gn/T/ipykernel_54342/194795960.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  data.loc['g'] = None

In [29]:
data

    이름    나이   성별    평점            연락처
0  김수안  19.0    여  4.35           None
1  김수정  23.0    여  4.23           None
2  박동윤  22.0    남  4.45           None
3  강이안  19.0    여  4.37           None
4  강지안  16.0    남  4.25           None
f  박성호  20.0    남  4.50  010-xxxx-xxxx
g  NaN   NaN  NaN   NaN            NaN

In [30]:
data.fillna(method = 'ffill')

    이름    나이 성별    평점            연락처
0  김수안  19.0  여  4.35           None
1  김수정  23.0  여  4.23           None
2  박동윤  22.0  남  4.45           None
3  강이안  19.0  여  4.37           None
4  강지안  16.0  남  4.25           None
f  박성호  20.0  남  4.50  010-xxxx-xxxx
g  박성호  20.0  남  4.50  010-xxxx-xxxx

In [31]:
data2 = data[['나이', '평점']]

In [32]:
data2

     나이    평점
0  19.0  4.35
1  23.0  4.23
2  22.0  4.45
3  19.0  4.37
4  16.0  4.25
f  20.0  4.50
g   NaN   NaN

In [33]:
data2.sum()

나이    119.00
평점     26.15
dtype: float64

In [34]:
data2.sum(axis = 1)

0    23.35
1    27.23
2    26.45
3    23.37
4    20.25
f    24.50
g     0.00
dtype: float64

In [35]:
data2.sum(axis = 1, skipna = False)

0    23.35
1    27.23
2    26.45
3    23.37
4    20.25
f    24.50
g      NaN
dtype: float64

In [36]:
data2.sum(axis = 0, skipna = False)

나이   NaN
평점   NaN
dtype: float64

In [37]:
data2.mean()

나이    19.833333
평점     4.358333
dtype: float64

In [38]:
data2.var()

나이    6.166667
평점    0.011377
dtype: float64

In [39]:
data2.describe()

              나이        평점
count   6.000000  6.000000
mean   19.833333  4.358333
std     2.483277  0.106661
min    16.000000  4.230000
25%    19.000000  4.275000
50%    19.500000  4.360000
75%    21.500000  4.430000
max    23.000000  4.500000

In [40]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to g
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   나이      6 non-null      float64
 1   평점      6 non-null      float64
dtypes: float64(2)
memory usage: 468.0+ bytes

In [41]:
data2

     나이    평점
0  19.0  4.35
1  23.0  4.23
2  22.0  4.45
3  19.0  4.37
4  16.0  4.25
f  20.0  4.50
g   NaN   NaN

In [42]:
data2.나이

0    19.0
1    23.0
2    22.0
3    19.0
4    16.0
f    20.0
g     NaN
Name: 나이, dtype: float64

In [43]:
data2.평점

0    4.35
1    4.23
2    4.45
3    4.37
4    4.25
f    4.50
g     NaN
Name: 평점, dtype: float64

In [44]:
data2.나이 = data2.나이.astype('Int64')

/var/folders/3d/kn7vpxbj1kq30df_5r2lj8q00000gn/T/ipykernel_54342/1876107722.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2.나이 = data2.나이.astype('Int64')

In [45]:
data

    이름    나이   성별    평점            연락처
0  김수안  19.0    여  4.35           None
1  김수정  23.0    여  4.23           None
2  박동윤  22.0    남  4.45           None
3  강이안  19.0    여  4.37           None
4  강지안  16.0    남  4.25           None
f  박성호  20.0    남  4.50  010-xxxx-xxxx
g  NaN   NaN  NaN   NaN            NaN

In [46]:
data.corr()  #상관계수

/var/folders/3d/kn7vpxbj1kq30df_5r2lj8q00000gn/T/ipykernel_54342/2627137660.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.corr()

          나이        평점
나이  1.000000  0.172412
평점  0.172412  1.000000

In [51]:
data.cov()  #공분산

/var/folders/3d/kn7vpxbj1kq30df_5r2lj8q00000gn/T/ipykernel_54342/2307035559.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.cov()  #공분산

          나이        평점
나이  6.166667  0.045667
평점  0.045667  0.011377

In [53]:
data.sort_index(ascending=False)

TypeError: '<' not supported between instances of 'int' and 'str'

In [58]:
data.sort_values(by=['평점'], ascending=False)  #평점을 기준으로 정렬, ascending=False를 통해 내림차순으로 정렬

    이름    나이   성별    평점            연락처
f  박성호  20.0    남  4.50  010-xxxx-xxxx
2  박동윤  22.0    남  4.45           None
3  강이안  19.0    여  4.37           None
0  김수안  19.0    여  4.35           None
4  강지안  16.0    남  4.25           None
1  김수정  23.0    여  4.23           None
g  NaN   NaN  NaN   NaN            NaN

In [59]:
data.sort_values(by=['나이'], ascending=False)

    이름    나이   성별    평점            연락처
1  김수정  23.0    여  4.23           None
2  박동윤  22.0    남  4.45           None
f  박성호  20.0    남  4.50  010-xxxx-xxxx
0  김수안  19.0    여  4.35           None
3  강이안  19.0    여  4.37           None
4  강지안  16.0    남  4.25           None
g  NaN   NaN  NaN   NaN            NaN

In [60]:
data.sort_values(by=['나이', '평점'], ascending=False)

    이름    나이   성별    평점            연락처
1  김수정  23.0    여  4.23           None
2  박동윤  22.0    남  4.45           None
f  박성호  20.0    남  4.50  010-xxxx-xxxx
3  강이안  19.0    여  4.37           None
0  김수안  19.0    여  4.35           None
4  강지안  16.0    남  4.25           None
g  NaN   NaN  NaN   NaN            NaN

In [61]:
data.sort_values(by=['나이', '평점'], ascending=False, ignore_index=True)

    이름    나이   성별    평점            연락처
0  김수정  23.0    여  4.23           None
1  박동윤  22.0    남  4.45           None
2  박성호  20.0    남  4.50  010-xxxx-xxxx
3  강이안  19.0    여  4.37           None
4  김수안  19.0    여  4.35           None
5  강지안  16.0    남  4.25           None
6  NaN   NaN  NaN   NaN            NaN

In [62]:
data.sort_values(by=['나이', '평점'], ascending=False, ignore_index=True, axis=1)

KeyError: '나이'

In [63]:
data.head()

    이름    나이 성별    평점   연락처
0  김수안  19.0  여  4.35  None
1  김수정  23.0  여  4.23  None
2  박동윤  22.0  남  4.45  None
3  강이안  19.0  여  4.37  None
4  강지안  16.0  남  4.25  None

In [64]:
data.head(3)

    이름    나이 성별    평점   연락처
0  김수안  19.0  여  4.35  None
1  김수정  23.0  여  4.23  None
2  박동윤  22.0  남  4.45  None

In [65]:
data.tail(3)

    이름    나이   성별    평점            연락처
4  강지안  16.0    남  4.25           None
f  박성호  20.0    남  4.50  010-xxxx-xxxx
g  NaN   NaN  NaN   NaN            NaN